---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetProperty.GetConnectedProperty(System.Int32)
source: html/e12badf1-5be9-dc40-3d0a-10ba466e8e20.htm
---
# Autodesk.Revit.DB.Visual.AssetProperty.GetConnectedProperty Method

Gets one connected property with specified index.

## Syntax (C#)
```csharp
public AssetProperty GetConnectedProperty(
	int index
)
```

## Parameters
- **index** (`System.Int32`)

## Returns
The AProperty of that index.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - index is out of range.